Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: This module provides the :class:`FileList` class, used for poking about the filesystem and building lists of files.
pl: Ten moduł dostarcza uogólnienie :class:`FileList`, używaną do działań wokół systemu plików i budowania list plików.

source: :mod:`distutils.log` --- Simple PEP 282-style logging
pl: :mod:`distutils.log` --- Proste logowanie w stylu PEP 282

source: :mod:`distutils.spawn` --- Spawn a sub-process
pl: :mod:`distutils.spawn` --- Utwórz podproces

source: This module provides the :func:`spawn` function, a front-end to various platform-specific functions for launching another program in a sub-process. Also provides :func:`find_executable` to search the path for a given executable name.
pl: Ten moduł dostarcza zadanie :func:`spawn`, sprzęg dostępu do różnych szczególnych dla maszyny/środowiska zadań służących uruchamianiu innych programów w pod-procesie. Dostarcza także zadanie :func:`find_executable` do przeszukiwania ścieżki pod kątem danej nazwy pliku wykonywalnego.

source: :mod:`distutils.sysconfig` --- System configuration information
pl: :mod:`distutils.sysconfig` --- informacje o konfiguracji systemu

source: The :mod:`distutils.sysconfig` module provides access to Python's low-level configuration information. The specific configuration variables available depend heavily on the platform and configuration. The specific variables depend on the build process for the specific version of Python being run; the variables are those found in the :file:`Makefile` and configuration header that are installed with Python on Unix systems. The configuration header is called :file:`pyconfig.h` for Python versions starting with 2.2, and :file:`config.h` for earlier versions of Python.
pl: Moduł :mod:`distutils.sysconfig` dostarcza dostęp do informacji o niskopoziomowej konfiguracji języka pytonowskiego. Szczególne zmienne konfiguracji dostępne zależą silnie od maszyny/środowiska i konfiguracji. Poszczególne zmienne zależą od procesu budowania szczególnych wersji języka pytonowskiego będących uruchomianymi; zmiennymi są te znajdujące się w pliku :file:`Makefile` i nagłówek konfiguracji które są instalowane z językiem pytonowskim w systemie Unix. Nagłówek konfiguracji zwany jest :file:`pyconfig.h` dla wersji języka pytonowskiego zaczynając od wersji 2.2 i pliku :file:`config.h` dla wcześniejszych wersji języka pytonowskiego.

source: Some additional functions are provided which perform some useful manipulations for other parts of the :mod:`distutils` package.
pl: Pewne dodatkowe zadania są dostarczone, które wykonują pewne użyteczne operacje dla innych części pakietu :mod:`distutils`.

source: The result of ``os.path.normpath(sys.prefix)``.
pl: Rezultat ``os.path.normpath(sys.prefix)``.

source: The result of ``os.path.normpath(sys.exec_prefix)``.
pl: Rezultat ``os.path.normpath(sys.exec_prefix)``.

source: Return the value of a single variable. This is equivalent to ``get_config_vars().get(name)``.
pl: Zwróć wartość pojedynczej zmiennej. Jest to równoważne ``get_config_vars().get(name)``.

source: Return a set of variable definitions. If there are no arguments, this returns a dictionary mapping names of configuration variables to values. If arguments are provided, they should be strings, and the return value will be a sequence giving the associated values. If a given name does not have a corresponding value, ``None`` will be included for that variable.
pl: Zwróć zbiór definicji zmiennych. Jeśli nie ma parametrów, zwraca słownik mapujący nazwy zmiennych konfiguracji do ich wartości. Jeśli dostarczono parametry, powinny być ciągami znaków, a wartość zwracana będzie będzie sekwencją dającą skojarzone wartości. Jeśli dana nazwa nie ma odpowiadającej wartości, ``None`` będzie załączone dla tej zmiennej.

source: Return the full path name of the configuration header. For Unix, this will be the header generated by the :program:`configure` script; for other platforms the header will have been supplied directly by the Python source distribution. The file is a platform-specific text file.
pl: Zwróć pełną nazwę ścieżki nagłówka konfiguracji. Dla Unix-a to będzie nagłówek wytworzony przez skrypt konfiguracji :program:`configure`; dla innych maszyn/środowisk będzie dostarczany bezpośrednio przez rozprowadzenie źródłowe języka pytonowskiego. Plik jest zależnym od maszyny/środowiska tekstowym plikiem.

source: Return the full path name of the :file:`Makefile` used to build Python. For Unix, this will be a file generated by the :program:`configure` script; the meaning for other platforms will vary. The file is a platform-specific text file, if it exists. This function is only useful on POSIX platforms.
pl: Zwróć pełną nazwę ścieżki pliku :file:`Makefile` użytego do budowania języka Pyton-owskiego. Dla Unix-a będzie to plik wytworzony przez skrypt konfiguracji :program:`configure`; znaczenie dla innych maszyn/środowisk może być różne. Plik jest szczególnym-dla-środowiska plikiem tekstowym, jeśli istnieje. To zadanie jest użyteczne tylko w środowisku POSIX-owym.

source: Return the directory for either the general or platform-dependent C include files. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true.
pl: Zwróć katalog dla zarówno ogólnych jak i zależnych-od-środowiska plików załączanych C. Jeśli *plat_specific* (z ang. - zależne_od_środowiska) jest prawdziwe, katalog załączanych plików źródłowych zależnych od środowiska jest zwracany; jeśli fałszywe lub pominięte katalog plików niezależnych-od-środowiska jest zwracany. Jeśli dany jest *przedrostek* ( - z ang. - *prefix*), jest on używany jako prefiks zamiast :const:`PREFIX`, lub jako przedrostek-pliku-wykonywalnego zamiast :const:`EXEC_PREFIX` jeśli *plat_specific* ( - z ang. - szczególny dla środowiska ) jest prawdziwe.

source: Return the directory for either the general or platform-dependent library installation. If *plat_specific* is true, the platform-dependent include directory is returned; if false or omitted, the platform-independent directory is returned. If *prefix* is given, it is used as either the prefix instead of :const:`PREFIX`, or as the exec-prefix instead of :const:`EXEC_PREFIX` if *plat_specific* is true. If *standard_lib* is true, the directory for the standard library is returned rather than the directory for the installation of third-party extensions.
pl: Zwróć katalog dla ogólnej lub zależnej-od-środowiska instalacji biblioteki. Jeśli flaga *plat_specific* ( - szczególny dla środowiska ) jest prawdziwa zależny od środowiska katalog jest zwracany; jeśli fałszywa lub pominięta niezależny-od środowiska katalog jest zwracany. Jeśli *prefix* jest dany, jest używany zarówno jako przedrostek zamiast :const:`PREFIX`, lub jako przedrostek-pliku-wykonywalnego zamiast :const:`EXEC_PREFIX` jeśli flaga *plat_specific* jest prawdziwa. Jeśli flaga *standard_lib* jest prawdziwa, katalog dla standardowej biblioteki jest zwracany zamiast katalogu dla instalowania rozszerzeń od firm-trzecich.

source: The following function is only intended for use within the :mod:`distutils` package.
pl: Następujące zadanie jest tylko przeznaczone do użycia wewnątrz pakietu :mod:`distutils`.

source: Do any platform-specific customization of a :class:`distutils.ccompiler.CCompiler` instance.
pl: Wykonaj szczególne-dla-środowiska dostosowania przykładu uogólnienia :class:`distutils.ccompiler.CCompiler`.

source: This function is only needed on Unix at this time, but should be called consistently to support forward-compatibility. It inserts the information that varies across Unix flavors and is stored in Python's :file:`Makefile`. This information includes the selected compiler, compiler and linker options, and the extension used by the linker for shared objects.
pl: To zadanie jest tylko potrzebne w Unix-ie w tym czasie, ale powinno być wywoływane konsekwentnie dla zapewnienia zgodności-z-przyszłymi-wersjami. Wstawia informację, która zmienia się w zależności od odmiany Unix-a i jest przechowywana w pliku :file:`Makefile` języka Pyton-owskiego. Ta informacja zawiera wybrany kompilator, opcje kompilatora i programu łączącego pliki wynikowe, i rozszerzenie używane przez program łączący pliki wynikowe dla współdzielonych przedmiotów.

source: This function is even more special-purpose, and should only be used from Python's own build procedures.
pl: To zadanie jest nawet bardziej szczególnego przeznaczenia, i powinno być tylko używane z procedur budowania języka Pyton-owskiego.

source: Inform the :mod:`distutils.sysconfig` module that it is being used as part of the build process for Python. This changes a lot of relative locations for files, allowing them to be located in the build area rather than in an installed Python.
pl: Informuj moduł :mod:`distutils.sysconfig`, który jest używany jako część procesu budowy języka Pyton-owskiego. To zmienia wiele względnych położeń plików, pozwalając im aby były umieszczane w przestrzeni budowy raczej zamiast w miejscu instalacji języka Pyton-owskiego.

source: :mod:`distutils.text_file` --- The TextFile class
pl: :mod:`distutils.text_file` --- uogólnienie TextFile

source: This module provides the :class:`TextFile` class, which gives an interface to text files that (optionally) takes care of stripping comments, ignoring blank lines, and joining lines with backslashes.
pl: Ten moduł dostarcza uogólnienia :class:`TextFile`, które daje sprzęg dostępu do plików tekstowych, które (opcjonalnie) zajmuje się oczyszczaniem z komentarzy, ignorowaniem pustych linii, i łączeniem linii ze skośnikami.

source: This class provides a file-like object that takes care of all the things you commonly want to do when processing a text file that has some line-by-line syntax: strip comments (as long as ``#`` is your comment character), skip blank lines, join adjacent lines by escaping the newline (ie. backslash at end of line), strip leading and/or trailing whitespace. All of these are optional and independently controllable.
pl: To uogólnienie dostarcza przedmiot pliko-podobny który zajmuje się wszystkimi rzeczami których zwykle oczekuje się przy przetwarzaniu pliku tekstowego, który ma pewną składnię linia-po-linii: zdejmowania komentarzy (tak długo jak ``#`` jest twoim znakiem komentarza), pomijania pustych linii, łączenia sąsiednich linii przez ucieczkowanie znaku nowej linii (tj. użycie skośnika na końcu linii), zdejmowania poprzedzających i zakańczających białych znaków. Wszystkie te są opcjonalne i kontrolowane niezależnie.

source: The class provides a :meth:`warn` method so you can generate warning messages that report physical line number, even if the logical line in question spans multiple physical lines. Also provides :meth:`unreadline` for implementing line-at-a-time lookahead.
pl: Uogólnienie dostarcza sposób postępowania :meth:`warn` tak, aby wytwarzać wiadomości ostrzegawcze, które raportują fizyczny numer linii, nawet jeśli logicznie oczekiwana linia rozciąga się na kilka fizycznych linii. Dostarcza także sposób postępowania :meth:`unreadline` ( - z ang. - cofnij wczytywanie ) dla wypełnienia czytania całej-linii-na-raz z wyprzedzeniem.

source: :class:`TextFile` instances are create with either *filename*, *file*, or both. :exc:`RuntimeError` is raised if both are ``None``. *filename* should be a string, and *file* a file object (or something that provides :meth:`readline` and :meth:`close` methods). It is recommended that you supply at least *filename*, so that :class:`TextFile` can include it in warning messages. If *file* is not supplied, :class:`TextFile` creates its own using the :func:`open` built-in function.
pl: Przykłady uogólnienia :class:`TextFile` są tworzone z nazwą *filename*, *file* lub obydwiema na raz. Błąd :exc:`RuntimeError` jest zgłaszany jeśli oba są ``None``. nazwa pliku *filename* powinna być ciągiem znaków, zaś *file* przedmiotem pliku ( lub czymś co dostarcza sposobów postępowania :meth:`readline` i :meth:`close`). Polecane jest dostarczenie przynajmniej *nazwy pliku* ( - z ang. - *filename*) tak, aby uogólnienie :class:`TextFile` mogło zawrzeć je w wiadomościach ostrzeżeń. Jeśli *plik* ( - z ang. - *file* ) nie jest dostarczony :class`TextFile` tworzy swój własny używając wbudowane zadania :func:`open`.

source: The options are all boolean, and affect the values returned by :meth:`readline`
pl: Opcje są wszystkie typu bool-owskiego i mają wpływ na zwracane wartości przez :meth:`readline`

source: option name
pl: nazwa opcji

source: default
pl: domyślne

source: *strip_comments*
pl: *strip_comments* ( - z ang. -*zdejmuj_komentarze*)

source: strip from ``'#'`` to end-of- line, as well as any whitespace leading up to the ``'#'``\ ---unless it is escaped by a backslash
pl: zdejmue zza ``'#'`` aż do końca-linii, zarówno, jak wszystkie białe znaki prowadzące do znaku ``'#'``\ ---chyba że zostanie poprzedzony znakiem skośnika

source: true
pl: prawda

source: strip leading whitespace from each line before returning it
pl: zdejmuj wszystkie wiodące białe znaki z każdej linii przed zwróceniem jej

source: false
pl: fałsz

source: strip trailing whitespace (including line terminator!) from each line before returning it.
pl: zdejmij kończące białe znaki (włączając w to znak końca linii!) z każdej linii przed zwróceniem jej.

source: skip lines that are empty \*after\* stripping comments and whitespace. (If both lstrip_ws and rstrip_ws are false, then some lines may consist of solely whitespace: these will \*not\* be skipped, even if *skip_blanks* is true.)
pl: pomiń linie które są puste \*po\* zdjęciu komentarzy i białych znaków. (Jeśli zarówno lstrip_ws i rstrip_ws są fałszywe, wtedy niektóre linie mogą składać się wyłącznie z białych znaków: te \*nie\* będą pominięte, nawet jeśli *skip_blanks* jest prawdziwe.)

source: if a backslash is the last non-newline character on a line after stripping comments and whitespace, join the following line to it to form one logical line; if N consecutive lines end with a backslash, then N+1 physical lines will be joined to form one logical line.
pl: jeśli skośnik jest ostatnim znakiem nie będącym znakiem nowej linii w wierszu po zdjęciu komentarzy i białych znaków, dołącz następną linię do tej aby utworzyć linię logiczną; jeśli N kolejnych linii kończy się skośnikiem wtedy N+1 fizycznych linii będzie połączonych w jedną logiczną linię.

source: strip leading whitespace from lines that are joined to their predecessor; only matters if ``(join_lines and not lstrip_ws)``
pl: zdejmij wiodące białe znaki z linii które są dołączone do ich poprzedników; ma znaczenie tylko jeśli ``(join_lines i nie lstrip_ws)``

source: Note that since *rstrip_ws* can strip the trailing newline, the semantics of :meth:`readline` must differ from those of the built-in file object's :meth:`readline` method! In particular, :meth:`readline` returns ``None`` for end-of-file: an empty string might just be a blank line (or an all-whitespace line), if *rstrip_ws* is true but *skip_blanks* is not.
pl: Zauważ że od kiedy *rstrip_ws* może zdjąć kończący znak nowej linii, składnia sposobu postępowania :meth:`readline` musi różnić się od tej należącej do wbudowanego sposobu postępowania :meth:`readline` w odniesieniu do przedmiotu uogólnienia pliku. W szczególności sposób postępowania :meth:`readline` zwraca ``None`` ( - z ang. - ``Żaden`` ) dla końca-pliku ( - z ang. - end-of-file) : pusty ciąg znaków może być po prostu pustą linią (lub linią białych znaków), jeśli *rstrip_ws* jest prawdziwe ale *skip_blanks* nie jest.

source: Open a new file *filename*. This overrides any *file* or *filename* constructor arguments.
pl: Otwórz nowy plik *filename*. To omija wszystkie parametry konstruktora *file* lub *filename*.

source: Close the current file and forget everything we know about it (including the filename and the current line number).
pl: Zamknij obecny plik i zapomnij wszystko co wiadomo na jego temat (włączając w to nazwę pliku i aktualny numer wiersza).

source: Print (to stderr) a warning message tied to the current logical line in the current file. If the current logical line in the file spans multiple physical lines, the warning refers to the whole range, such as ``"lines 3-5"``. If *line* is supplied, it overrides the current line number; it may be a list or tuple to indicate a range of physical lines, or an integer for a single physical line.
pl: Wypisz (na stderr) wiadomość ostrzeżenia dowiązaną do aktualnej logicznej linii w obecnym pliku. Jeśli aktualna logiczna linia w pliku rozciąga się na kilka fizycznych linii, ostrzeżenie odnosi się do całego zakresu np. ``"linie 3-5"``. Jeśli (*line* - z ang. - linia) jest dostarczona nadpisuje ona aktualny numer linii; może być listą, krotką aby zaznaczyć zakres fizycznych linii, lub liczbę całkowitą dla pojedynczej fizycznej linii.

source: Read and return a single logical line from the current file (or from an internal buffer if lines have previously been "unread" with :meth:`unreadline`). If the *join_lines* option is true, this may involve reading multiple physical lines concatenated into a single string. Updates the current line number, so calling :meth:`warn` after :meth:`readline` emits a warning about the physical line(s) just read. Returns ``None`` on end-of-file, since the empty string can occur if *rstrip_ws* is true but *strip_blanks* is not.
pl: Wczytaj i zwróć pojedynczą logiczną linię z aktualnego pliku (lub z wewnętrznej przestrzeni wymiany jeśli linie były przedtem "cofnięte" (- z ang. - "unread" ) przy użyciu sposobu postępowania :meth:`unreadline`). Jeśli opcja *join_lines* jest prawdziwa, może to oznaczać wczytanie kilku fizycznych linii złączonych w jeden ciąg znaków. Uaktualnia aktualny numer wiersza, więc wywołanie sposobu postępowania :meth:`warn` po sposobie postępowania :meth:`readline` wysyła ostrzeżenie o aktualnie wczytanych fizycznych lini(ach). Zwraca ``Żaden`` - z ang. - ``None`` przy końcu-pliku, gdyż pusty ciąg znaków może zdarzyć się, jeśli *rstrip_ws* jest prawdziwe ale *strip_blanks* nie jest.

source: Read and return the list of all logical lines remaining in the current file. This updates the current line number to the last line of the file.
pl: Wczytaj i zwróć listę wszystkich logicznych linii pozostałych w obecnym pliku. To aktualizuje obecny numer wiersza na ostatni wiersz pliku.

source: Push *line* (a string) onto an internal buffer that will be checked by future :meth:`readline` calls. Handy for implementing a parser with line-at-a-time lookahead. Note that lines that are "unread" with :meth:`unreadline` are not subsequently re-cleansed (whitespace stripped, or whatever) when read with :meth:`readline`. If multiple calls are made to :meth:`unreadline` before a call to :meth:`readline`, the lines will be returned most in most recent first order.
pl: Pchnij *linię* (ciąg znaków) na wewnętrzną przestrzeń wymiany, która zostanie sprawdzona przez przyszłe wywołania sposobu postępowania :meth:`readline`. Poręczne przy wypełnianiu programu wczytującego jedną-linię-na-raz z wyprzedzeniem. Zauważ, że linie, które są "cofane" ( - z ang. - "unread" ) sposobem postępowania :meth:`unreadline` nie są powtórnie czyszczone (z białych znaków, lub jakkolwiek) gdy są wczytywane za pomocą sposobu postępowania :meth:`readline`. Jeśli wielokrotne wykonywane są odwołania do :meth:`unreadline` przed wywołaniem sposobu postępowania :meth:`readline` linie zostaną zwrócone w kolejności najmniej dawnego na początku.

source: :mod:`distutils.version` --- Version number classes
pl: :mod:`distutils.version` --- uogólnienia numerów wersji

source: :mod:`distutils.cmd` --- Abstract base class for Distutils commands
pl: :mod:`distutils.cmd` --- Abstrakcyjne uogólnienie podstawowe dla komend modułu Distutils

source: This module supplies the abstract base class :class:`Command`.
pl: Ten moduł dostarcza abstrakcyjnych uogólnień podstawowych :class:`Command`.

source: Abstract base class for defining command classes, the "worker bees" of the Distutils. A useful analogy for command classes is to think of them as subroutines with local variables called *options*. The options are declared in :meth:`initialize_options` and defined (given their final values) in :meth:`finalize_options`, both of which must be defined by every command class. The distinction between the two is necessary because option values might come from the outside world (command line, config file, ...), and any options dependent on other options must be computed after these outside influences have been processed --- hence :meth:`finalize_options`. The body of the subroutine, where it does all its work based on the values of its options, is the :meth:`run` method, which must also be implemented by every command class.
pl: Abstrakcyjne uogólnienie podstawowe dla definiowania uogólnień poleceń, "pracowitych pszczółek" Distutils. Użytecznym porównaniem uogólnień poleceń jest myślenie o nich jak o podprogramach z lokalnymi zmiennymi zwanymi *opcjami*. Opcje są deklarowane sposobem postępowania :meth:`initialize_options` i określane (znając ich ostateczne wartości) w sposobie postępowania :meth:`finalize_options`, z których obie muszą być zdefiniowane przez każde uogólnienie polecenia. Rozróżnienie pomiędzy nimi jest konieczne ponieważ wartości opcji mogą przychodzić z zewnętrznego świata (wiersz poleceń, plik konfiguracji, ...), i dowolne opcje zależne od innych opcji muszą być obliczone po tym, jak te zewnętrzne wpływy zostaną przetworzone --- stąd :meth:`finalize_options`. Ciałem podprogramu, gdzie wykonuje całą swoją pracę opartą o wartości swoich opcji, jest sposób postępowania :meth:`run`, który musi być określony przez każde uogólnienie polecenia.

source: The class constructor takes a single argument *dist*, a :class:`Distribution` instance.
pl: konstruktor uogólnienia pobiera pojedynczy paramter *dist* - przykład uogólnienia - :class:`Distribution`.

source: :mod:`distutils.command` --- Individual Distutils commands
pl: :mod:`distutils.command` --- indywidualne polecenia Distutils

source: :mod:`distutils.command.bdist` --- Build a binary installer
pl: :mod:`distutils.command.bdist` --- Zbuduj binarną wersję instalatora

source: :mod:`distutils.command.bdist_packager` --- Abstract base class for packagers
pl: :mod:`distutils.command.bdist_packager` --- abstrakcyjne uogólnienie podstawowe dla pakowaczy

source: :mod:`distutils.command.bdist_dumb` --- Build a "dumb" installer
pl: :mod:`distutils.command.bdist_dumb` --- Zbuduj "głupi" instalator

source: :mod:`distutils.command.bdist_msi` --- Build a Microsoft Installer binary package
pl: :mod:`distutils.command.bdist_msi` --- Zbuduj instalator Microsoftu w postaci binarnej paczki

source: Builds a `Windows Installer`_ (.msi) binary package.
pl: Buduje `Instalator Windowsa` _ (.msi) w postaci paczki binarnej

source: In most cases, the ``bdist_msi`` installer is a better choice than the ``bdist_wininst`` installer, because it provides better support for Win64 platforms, allows administrators to perform non-interactive installations, and allows installation through group policies.
pl: W większości przypadków, instalator ``bdist_msi`` jest lepszym rozwiązaniem niż ``bdist_wininst``, ponieważ dostarcza to lepszego wsparcia dla środowiska Win64, pozwala administratorom wykonywać zaplanowane instalacje i pozwala na instalacje przez uprawnienia grup.

source: :mod:`distutils.command.bdist_rpm` --- Build a binary distribution as a Redhat RPM and SRPM
pl: :mod:`distutils.command.bdist_rpm` --- Zbuduj dystrybucję binarną jako pakiet Redhat-a RPM i SRPM
